// C-style comments.
// First non-comment line must be the following:
MCSkin3D Language File
// Following lines are key-value pairs, stored by the program.
// A line beginning with the pound/sharp/hash sign # are
// used internally and are not actual language pieces.
#Name=العربية
// Version is the version of the language file - it does not
// have any effect other than identification, and does not
// need to be present.
#Version=1.0
// SuppVersion is short for Supported Version, and denotes the version in which this
// language file was made for. Any other version running this file will throw an error.
#SuppVersion=1.4
// Culture is the Windows culture ID for the language.
// This is REQUIRED to be set properly!
#Culture="ar-SA"

// These lines are not required, they are simply for identification
// purposes.
#Author="Paril"
#AuthorContact="paril@alteredsoftworks.com"
#AuthorSite="www.alteredsoftworks.com"

// Below this are the key-value pairs; ID=String
// Note that the quotes are not required, but may be used for readability purposes.
// Language developers should use this file, and not other languages, to determine the
// context in which the string is deriving - otherwise, you may lose accuracy of your
// translation over time (see TranslationParty).
C_OK="موافق"
C_CANCEL="إلغاء"
C_CLOSE="إغلاق"
C_COPYTOCLIPBOARD="نسخ إلى الحافظة"

M_FILE="ملف"
	M_SAVE="حفظ"
	M_SAVEAS="حفظ باسم"
	M_SAVEALL="حفظ الكل"
	M_UPLOAD="رفع الجلد..."
	M_EXIT="خروج"
M_EDIT="تحرير"
	M_UNDO="تراجع"
	M_REDO="إعادة"
	M_TOOL="أدوات"
M_VIEW="عرض"
	M_MODE="نمط العرض"
		M_PERSPECTIVE="منظور (ثلاثي الأبعاد)"
		M_TEXTURE="نسيج (ثنائي الأبعاد)"
		M_HYBRID="مختلط"
	M_3D="إعدادات ثلاثية الأبعاد"
		M_ANIMATE="تحريك"
		M_FOLLOWCUR="اتبع المؤشر"
		M_GRASS="عشب"
		M_GHOST="إظهار الأجزاء المخفية كشبح"
		M_MULTISAMPLING="متعدد العينات"
	M_2D="إعدادات ثنائية الأبعاد"
		M_ALPHACHECKER="رقعة الشفافية"
		M_OVERLAY="تراكب"
			M_ENABLEOVERLAY="تمكين"
	M_TRANSMODE="نمط الشفافية"
		M_OFF="إيقاف"
		M_HELMETONLY="خوذة فقط"
		M_ALL="الكل"
	M_VISIBLEPARTS="الأجزاء المرئية"
		M_HEAD="رأس"
		M_HELMET="خوذة"
		M_CHEST="صدر"
		M_LEFTARM="ذراع أيسر"
		M_RIGHTARM="ذراع أيمن"
		M_LEFTLEG="ساق يسرى"
		M_RIGHTLEG="ساق يمنى"
M_OPTIONS="خيارات"
	M_KEYSHORTCUTS="اختصارات لوحة المفاتيح"
	M_BGCOLOR="لون الخلفية (يتطلب إعادة التشغيل)"
	M_USETEXTUREBASES="استخدام النسيج الأساسي"
M_LANGUAGE="اللغة"
M_HELP="مساعدة"
	M_CHECKUPDATES="التحقق من التحديثات"
	M_AUTOUPDATE="التحقق التلقائي من التحديثات"

T_TREE_ZOOMOUT="تصغير"
T_TREE_ZOOMIN="تكبير"
T_TREE_IMPORTHERE="استيراد هنا..."
T_TREE_NEWFOLDER="مجلد جديد هنا..."
T_TREE_RENAME="إعادة تسمية..."
T_TREE_DELETE="حذف..."
T_TREE_CLONE="استنساخ"
T_TREE_UPLOAD="رفع"

T_SAVE="حفظ"
T_SAVEALL="حفظ الكل"
T_UNDO="تراجع"
T_REDO="إعادة"
T_PERSPECTIVE="منظور"
T_TEXTURE="نسيج"
T_HYBRID="مختلط"
T_SCREENSHOT="لقطة شاشة (Shift للحفظ)"
T_TOGGLEHEAD="إظهار/إخفاء الرأس"
T_TOGGLEHELMET="إظهار/إخفاء الخوذة"
T_TOGGLECHEST="إظهار/إخفاء الصدر"
T_TOGGLELEFTARM="إظهار/إخفاء الذراع الأيسر"
T_TOGGLERIGHTARM="إظهار/إخفاء الذراع الأيمن"
T_TOGGLELEFTLEG="إظهار/إخفاء الساق اليسرى"
T_TOGGLERIGHTLEG="إظهار/إخفاء الساق اليمنى"
T_SWATCHES="عينة الألوان"

M_IMPORT_HERE="استيراد هنا..."
M_NEWFOLDER="مجلد جديد"
M_NEWFOLDER_HERE="مجلد جديد هنا..."
M_RENAME="إعادة تسمية..."
M_DELETE="حذف..."
M_CLONE="استنساخ"

T_TOOL_CAMERA="كاميرا"
T_TOOL_PENCIL="قلم رصاص"
T_TOOL_ERASER="ممحاة"
T_TOOL_DROPPER="قطارة"
T_TOOL_DODGEBURN="حرق/تفتيح"
T_TOOL_DARKENLIGHTEN="تعتيم/تفتيح"
T_TOOL_BUCKET="دلو الطلاء"
T_TOOL_NOISE="تشويش"

B_MSG_DIRMISSING="دليل مفقود - غالبًا لأنك لم تقم بفك ضغط البرنامج. على الرغم من أنها ليست مشكلة خطيرة، إلا أنك ستفقد أي قوالب وعينات ألوان ومحتويات أخرى مرفقة."
B_MSG_UPTODATE="لديك بالفعل أحدث وأفضل إصدار!"
B_MSG_NEWUPDATE="يتوفر تحديث جديد. هل تريد فتح برنامج التحديث الآن؟"
B_MSG_UPLOADERROR="خطأ في رفع الجلد:"
B_MSG_UPLOADSUCCESS="تم رفع الجلد بنجاح!"
B_MSG_DELETESKIN="هل تريد حذف هذا الجلد؟\r\nسيتم نقله إلى سلة المحذوفات."
B_MSG_DELETEFOLDER="هل تريد حذف هذا المجلد؟\r\nسيتم نقله إلى سلة المحذوفات."
B_MSG_OVERLAYERROR="تعذر تحميل صورة التراكب: “{0}”؛ هل الدقة من قوى العدد 2؟"
B_MSG_UPLOADRES="على الرغم من أنه يمكنك تحرير النسيج عالي الدقة باستخدام MCSkin3D، إلا أنه لا يمكنك رفعه إلى ملفك الشخصي في Minecraft."
B_MSG_ANTIALIAS="أعد تشغيل MCSkin3D لتطبيق خيار متعدد العينات."
B_MSG_PIXELFORMAT="عذرًا، بطاقة الرسوميات الخاصة بك لا تدعم تنسيق 32 بت لكل بكسل — وهو حاليًا ضروري لتشغيل MCSkin3D بشكل صحيح."
B_MSG_SHORTCUTEXISTS="الاختصار “{0}” يتعارض مع “{1}” — تم إفراغه."

B_CAP_QUESTION="سؤال"
B_CAP_SORRY="عذرًا"

C_SQUARE="مربع"
C_CIRCLE="دائرة"

O_EXPOSURE="التعريض:"
O_INCREMENTAL="زيادة"
O_LIGHTEN="تفتيح"
O_DARKEN="تعتيم"
O_DODGE="حرق"
O_BURN="تفتيح (بديل)"
Q_THRESHOLD="الحد الأدنى:"

C_NEW="جديد"
C_CANTMOVE="لا يمكن النقل إلى"
C_COPY="نسخ"
C_MOVE="نقل"
C_MOVED="تم النقل"
C_COPYTO="نسخ إلى"
C_MOVETO="نقل إلى"
C_IMPORTTO="استيراد إلى"

C_SETTINGSFAILED="فشل تحميل ملف الإعدادات؛ تم تحميل الإعدادات الافتراضية."

C_AUTOLOGIN="تسجيل الدخول تلقائيًا؟"
C_REMEMBER="تذكرني؟"
C_USERNAME="اسم المستخدم:"
C_PASSWORD="كلمة المرور:"
C_UPLOADTEXT="لرفع جلدك، يجب عليك تسجيل الدخول إلى Minecraft.net. يمكن لهذا البرنامج القيام بذلك تلقائيًا؛ أدخل اسم المستخدم وكلمة المرور للمتابعة."

C_UPLOADING="جاري رفع جلدك... الرجاء الانتظار..."
C_SHORTCUTINUSE="الاختصار قيد الاستخدام بالفعل"

S_TREEVIEW_ZOOMIN="تكبير عرض الشجرة"
S_TREEVIEW_ZOOMOUT="تصغير عرض الشجرة"
S_SWATCH_ZOOMIN="تكبير عينة الألوان"
S_SWATCH_ZOOMOUT="تصغير عينة الألوان"
S_COLORSWAP="تبديل لون المقدمة/الخلفية"
S_RENAME="تغيير الاسم"
S_CLONE="استنساخ العقدة"
S_DELETE="حذف العقدة"
S_SCREENSHOT_CLIP="لقطة شاشة إلى الحافظة"
S_SCREENSHOT_SAVE="حفظ لقطة الشاشة"
S_TOGGLEVIEW="تبديل نمط العرض"
S_TOGGLETRANS="تبديل نمط الشفافية"

M_SHORTCUTS="انقر على مربع النص أدناه، ثم اضغط على المفتاح الذي تريد تعيينه لهذا الاختصار."
W_OPTIONS="إظهار/إخفاء خيارات الأداة"

T_CAMERA="زر الفأرة الأيسر للتدوير. زر الفأرة الأيمن/العجلة للتكبير/التصغير."
T_PENCIL="زر الفأرة الأيسر للرسم؛ زر الفأرة الأيمن/العجلة للتدوير/التكبير؛ اضغط مع الاستمرار على Shift لاستخدام لون الخلفية."
T_DROPPER="زر الفأرة الأيسر لانتقاء اللون. زر الفأرة الأيمن/العجلة للتدوير/التكبير. اضغط مع الاستمرار على Shift لانتقاء كلون خلفية، وإلا كلون مقدمة."
T_DODGEBURN="زر الفأرة الأيسر للحرق/التفتيح. زر الفأرة الأيمن/العجلة للتدوير/التكبير. Shift لتبديل الأداة."
T_DARKENLIGHTEN="زر الفأرة الأيسر للتعتيم/التفتيح. زر الفأرة الأيمن/العجلة للتدوير/التكبير. Shift لتبديل الأداة."
T_ERASER="زر الفأرة الأيسر للمسح إلى لون شفاف وقناة ألفا. زر الفأرة الأيمن/العجلة للتدوير/التكبير."
T_FILL="زر الفأرة الأيسر لملء البكسلات. Shift لاستخدام لون الخلفية. Ctrl لقفل الجزء. زر الفأرة الأيمن/العجلة للتدوير/التكبير."
T_NOISE="زر الفأرة الأيسر لتطبيق التشويش. زر الفأرة الأيمن/العجلة للتدوير/التكبير."

C_UNSAVED="لديك تغييرات غير محفوظة، هل أنت متأكد من رغبتك في الخروج؟"
C_UNSAVED_CAPTION="انتظر!"

O_HOLDNESS="شدة الحفاظ:"

G_BRUSH="فرشاة"
G_BRUSHOPTS="خيارات الفرشاة"
G_NOISEOPTS="خيارات التشويش"
G_FILLOPTS="خيارات الملء"
G_TOOL="أداة"

T_DECRES="خفض الدقة"
T_INCRES="رفع الدقة"

M_NEWSKIN="جلد جديد"
M_NEWSKIN_HERE="جلد جديد هنا"

M_SKINERROR="تعذر تنزيل الجلد من مخزن Minecraft!"
M_FETCH_NAME="جلب من Minecraft"
M_FETCH_TEXT="يمكن لـ MCSkin3D جلب الجلد من حساب Minecraft الخاص بك (أو أي شخص آخر) واستيراده كملف جلد. أدخل اسم الحساب أدناه ثم انقر على 'استيراد'!"
M_PLAYER_NAME="اسم اللاعب:"

C_YES="نعم"
C_NO="لا"
D_DONTASK="لا تسألني مرة أخرى"
M_IRREVERSIBLE="ملاحظة: لا يمكن رفع الجلود عالية الدقة كجلد إلى Minecraft.net!\n\nهذه العملية لا رجعة فيها وستؤدي إلى فقدان جميع وظائف التراجع/الإعادة السابقة. هل أنت متأكد من رغبتك في المتابعة؟"

M_TEMP="أنت تحاول تشغيل MCSkin3D من موقع مؤقت. الرجاء فك ضغط البرنامج بشكل صحيح قبل تشغيله."

T_RESETCAMERA="إعادة ضبط الكاميرا"
M_SKINDIRS="أدلة الجلود"
M_DYNAMICOVERLAY="تراكب ديناميكي"
M_DYNAMICOPTIONS="خيارات ديناميكية"
M_LINECOLOR="لون الخط"
M_LINESIZE="سمك الخط"
M_OVERLAYTEXTSIZE="حجم النص"
M_TEXTCOLOR="لون النص"

U_PIXELSCHANGED="تم تغيير البكسلات"
T_TOOL_STAMP="طابع"
T_STAMP="انقر بزر الفأرة الأيسر لاستخدام الطابع. اضغط مع الاستمرار على Shift وانقر لنسخ منطقة إلى الفرشاة."
L_UNDOACTIONS="تراجع عن {0} عملية"
L_REDOACTIONS="إعادة {0} عملية"

M_BROWSE="تصفح إلى موقع {0}"
M_SKIN="جلد"
M_FOLDER="مجلد"

M_SHARED="خيارات مشتركة"
M_INFINITEMOUSE="فأرة لا نهائية"

T_SWATCHEDIT="تحرير عينة الألوان"
T_DELETESWATCH="حذف عينة الألوان"
T_ADDSWATCH="إضافة عينة ألوان"

M_EXPT_EXCEPTION="استثناء!"
M_EXPT_APPERROR="خطأ في التطبيق!"
M_EXPT_ERRORTEXT="واجه MCSkin3D خطأ وقد يصبح غير مستقر. ومع ذلك، لا تقلق، يمكنك اتخاذ بعض الإجراءات للمساعدة!\r\n\r\nإذا كنت ترغب في مساعدة المطور، يرجى إرسال تقرير الخطأ إلينا! في أسفل هذه النافذة يوجد رابط أزرق يشير إلى محتوى تقرير الخطأ. إرساله إلينا (ابحث عنا على PlanetMinecraft) سيساعد بشكل كبير في التطوير!"
M_EXPT_SHOW="عدم عرض هذه الرسالة مرة أخرى"
M_EXPT_CLOSE="إغلاق"
M_EXPT_VIEW="لعرض التقرير، انقر"
M_EXPT_HERE="هنا"

C_RESTART="يجب إعادة تشغيل البرنامج لتنفيذ هذه العملية!"
C_RESTART_CAPTION="إعادة التشغيل مطلوبة"
D_UNSAVED="لديك جلود غير محفوظة؛ تغيير دليل الجلود يتطلب تحديث قائمة الجلود، وبالتالي ستفقد جميع التغييرات غير المحفوظة. انقر فوق 'نعم' للتحديث دون حفظ؛ أو 'لا' للانتظار حتى إعادة التشغيل؛ أو 'إلغاء' لإلغاء العملية."
D_UNSAVED_CAPTION="تغييرات غير محفوظة"

M_RENDERSTATS="إحصائيات العرض"
M_GRIDCOLOR="لون الشبكة"
M_GRIDOPACITY="عتامة الشبكة"

M_LOADING="جاري التحميل..."
M_NEWPALETTE="لوحة ألوان جديدة"
M_DELETEPALETTE="حذف لوحة الألوان"
M_CONVERTSWATCH="تحويل عينة الألوان..."
M_RENAMEPALETTE="إعادة تسمية لوحة الألوان"
M_CURRENTFORMAT="التنسيق الحالي:"
M_NEWFORMAT="التنسيق الجديد:"
M_SWATCHQUESTION="سيؤدي هذا الإجراء إلى حذف عينة الألوان هذه بشكل دائم. هل تريد المتابعة؟"
M_SWATCHQUESTION_CAPTION="هل أنت متأكد؟"

M_UPDATESTARTING="تم تنزيل التحديث - سيتم إغلاق MCSkin3D الآن وسيتم فتح برنامج التحديث. لاحظ أن هذا البرنامج يعمل من مجلدك المؤقت، لذلك قد يصدر Windows (أو برنامج مكافحة الفيروسات الخاص بك) تحذيرًا - لا تقلق، هذا فقط للحفاظ على الدليل الرئيسي نظيفًا من ملفات التحديث."
M_REPORTVIEWER="عارض التقارير"

M_GRIDENABLED="إظهار الشبكة"
M_RENDERRESTART="تغيير نمط العرض يتطلب إعادة التشغيل."
M_RENDERER="محرك العرض"
M_CLIENTARRAYS="مصفوفات العميل"
M_IMMEDIATE="الوضع المباشر"
W_POPOUT="منبثق"

E_SKINERROR="خطأ أثناء تحميل الجلد “{0}”؛ يرجى حذف هذا الملف أو نقله خارج المجلد."
T_TOGGLECHESTARMOR="إظهار/إخفاء الدرع الصدري"
T_TOGGLELEFTARMARMOR="إظهار/إخفاء واقي الذراع الأيسر"
T_TOGGLERIGHTARMARMOR="إظهار/إخفاء واقي الذراع الأيمن"
T_TOGGLELEFTLEGARMOR="إظهار/إخفاء واقي الساق اليسرى"
T_TOGGLERIGHTLEGARMOR="إظهار/إخفاء واقي الساق اليمنى"

M_CHESTARMOR="درع صدري"
M_LEFTARMARMOR="واقي ذراع أيسر"
M_RIGHTARMARMOR="واقي ذراع أيمن"
M_LEFTLEGARMOR="واقي ساق يسرى"
M_RIGHTLEGARMOR="واقي ساق يمنى"

C_SCALE="قياس"
C_CROP="قص"
M_SKINSIZEMISMATCH="حجم هذا الجلد لا يتطابق مع الحجم المتوقع من النموذج المحدد. يمكن لـ MCSkin3D حل هذه المشكلة بإحدى الطريقتين التاليتين:\n\nالقص: ضبط حجم الجلد مباشرة ليتناسب مع حجم النموذج دون تعديل الجلد نفسه. لاحظ أنه اعتمادًا على اختلاف الحجم، قد يتم قص بعض أجزاء الجلد. استخدم هذا الخيار إذا كنت تقوم بتحويل الجلد من الإصدار 1.7 إلى 1.8.\n\nالقياس: قياس الجلد ليناسب الحجم المطلوب.\n\nلاحظ أن هذه عملية تدميرية ولا يمكن التراجع عنها."